In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2008_0715/02002.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(7, 30)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,"U.S. Representative, District 4 Democratic 100...",NaN,NaN,NaN,"Johnson 47,439","Totals 47,439",NaN,NaN,NaN,100.0%,...,GWINNETT,21.0,21.0,1378.0,1378.0,ROCKDALE,18.0,18.0,2881.0,2881.0
1,NaN,NaN,NaN,"Johnson 47,439","Totals 47,439",NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,100.0%,100.0%,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PR,TP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DEKALB,142,142,43180,43180,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
4,DEKALB,142,142,43180,43180,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,GWINNETT,21,21,1378,1378,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,ROCKDALE,18,18,2881,2881,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,3]]]

In [9]:
df.head(5)

          0      3
4    DEKALB  43180
5  GWINNETT   1378
6  ROCKDALE   2881

In [10]:
df.columns = ['county', 'Henry C. "Hank" Johnson, Jr.']

In [11]:
df.tail(5)

     county Henry C. "Hank" Johnson, Jr.
4    DEKALB                        43180
5  GWINNETT                         1378
6  ROCKDALE                         2881

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

     county                     candidate  votes
0    DEKALB  Henry C. "Hank" Johnson, Jr.  43180
1  GWINNETT  Henry C. "Hank" Johnson, Jr.   1378
2  ROCKDALE  Henry C. "Hank" Johnson, Jr.   2881

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
county       3 non-null object
candidate    3 non-null object
votes        3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '4'

In [19]:
df['party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate                     party
Henry C. "Hank" Johnson, Jr.  Democrat    47439
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,DEKALB,U.S. Representative,4,Democrat,"Henry C. ""Hank"" Johnson, Jr.",43180
1,GWINNETT,U.S. Representative,4,Democrat,"Henry C. ""Hank"" Johnson, Jr.",1378
2,ROCKDALE,U.S. Representative,4,Democrat,"Henry C. ""Hank"" Johnson, Jr.",2881

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')